Public Member Functions | Friends | List of all members
API_AttributeIndex Class Reference
Dialog and Palette integration
Index reference to an attribute. More...
#include <APIdefs_AttributeIndex.hpp>
 Public Member Functions
 bool  | operator== (const API_AttributeIndex &rightOp) const
 bool  | operator!= (const API_AttributeIndex &rightOp) const
 Int32  | ToInt32_Deprecated () const
 ULong  | GenerateHashValue () const
 GSErrCode  | ReadAsInt32 (GS::IChannel &ic)
 GSErrCode  | WriteAsInt32 (GS::OChannel &oc) const
 GS::UniString  | ToUniString () const
 bool  | IsPositive () const
 bool  | IsNegative () const
 Friends
API_AttributeIndex  | ACAPI_CreateAttributeIndex (Int32 index)
A wrapper function to create an API_AttributeIndex from its GS equivalent.
Detailed Description
Index reference to an attribute.
Remarks
 In version 23, the short type attribute index references are replaced with this new type definition.
Friends And Related Symbol Documentation
◆ ACAPI_CreateAttributeIndex
 API_AttributeIndex ACAPI_CreateAttributeIndex  |  ( |  Int32  |  index | )
friend
A wrapper function to create an API_AttributeIndex from its GS equivalent.
Since
Archicad 27
Parameters
index | [in] The attribute index to convert.
Returns
The API equivalent.